export class Mainmenu {
    UI = [
        "",
        "",
        "",
        "                          \\#\\   /#/   /######|    /#####|      /##\\      |######\\   |######|",
        "                           \\#\\ /#/   /#/         |#|          /#/\\#\\     |#|   |#|  |#|",
        "                            \\# #/    \\#\\         |#|         /#/  \\#\\    |#|   |#|  |#|",
        "                             \\#/      \\######\\   |#|        /#/    \\#\\   |######/   |######|",
        "                             |#|            \\#\\  |#|       ╔##########╗  |#|        |#|",
        "                             |#|            /#/  |#|       |#|      |#|  |#|        |#|",
        "                             |#|     |#######/    \\#####|  |#|      |#|  |#|        |######|" ,
        "", // Moitié
        "",
        "                                                1: Sélection des héros",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ];

    constructor() {
        
    }

    affiche(): void {
        console.clear()
        for (let i = 0; i < this.UI.length; i++) {
            let color = '\x1b[37m%s\x1b[0m'
            if (i < 10) {
                color = '\x1b[31m%s\x1b[0m'
            }
            console.log(color, this.UI[i]);
        };
    };
};
/*
class Classesmenu {

};*/